# -*- coding: utf-8 -*-
"""
Created on Mon Dec 05 19:18:12 2016

@author: Raymond
"""

import pandas_datareader.data as web
import pandas as pd
import numpy as np
import datetime
import warnings

warnings.simplefilter(action = "ignore", category = FutureWarning)



Tickers = ['2330','2317','6505','2412','2882','1301','1326','1303','2881','3008',
           '2308','2002','3045','2454','2891','2886','1216','2311','2912','4904',
           '2382','2892','2207','2105','2357','4938','2474','2880','5880','2395',
           '2884','2801','2325','2303','2885','1101','1402','2408','2823','2883',
           '2354','2301','9904','2409','2887','3481','8464','2890','1102','1476']

Stock_dict = {'2330':u'台積電','2317':u'鴻海','6505':u'台塑化','2412':u'中華電',
              '2882':u'國泰金','1301':u'台塑','1326':u'台化','1303':u'南亞',
              '2881':u'富邦金','3008':u'大立光','2308':u'台達電','2002':u'中鋼',
              '3045':u'台灣大','2454':u'聯發科','2891':u'中信金','2886':u'兆豐金',
              '1216':u'統一','2311':u'日月光','2912':u'統一超','4904':u'遠傳',
              '2382':u'廣達','2892':u'第一金','2207':u'和泰車','2105':u'正新',
              '2357':u'華碩','4938':u'和碩','2474':u'可成','2880':u'華南金',
              '5880':u'合庫金','2395':u'研華','2884':u'玉山金','2801':u'彰銀',
              '2325':u'矽品','2303':u'聯電','2885':u'元大金','1101':u'台泥',
              '1402':u'遠東新','2408':u'南亞科','2823':u'中壽','2883':u'開發金',
              '2354':u'鴻準','2301':u'光寶科','9904':u'寶成','2409':u'友達',
              '2887':u'台新金','3481':u'群創','8464':u'億豐','2890':u'永豐金',
              '1102':u'亞泥','1476':u'儒鴻',
              '2324':u'仁寶',
              '9910':u'豐泰',
              '2356':u'英業達',
              '9921':u'巨大',
              '2498':u'宏達電',
              '1227':u'佳格',
              '2377':u'微星',
              '3034':u'聯詠',
              '6239':u'力成',
              '3702':u'大聯大',
              '5871':u'中租-KY',
              '2618':u'長榮航',
              '3231':u'緯創',
              '2227':u'裕日車',
              '1504':u'東元',
              '2542':u'興富發',
              '2915':u'潤泰全',
              '2347':u'聯強',
              '9945':u'潤泰新',
              '2385':u'群光',
              '2610':u'華航',
              '4958':u'臻鼎-KY',
              '2379':u'瑞昱',
              '2633':u'台灣高鐵',
              '1434':u'福懋',
              '2834':u'臺企銀',
              '1605':u'華新',
              '1590':u'亞德客-KY',
              '2201':u'裕隆',
              '3682':u'亞太電',
              '2106':u'建大',
              '2353':u'宏碁',
              '2603':u'長榮',
              '3532':u'台勝科',
              '2723':u'美食-KY',
              '9914':u'美利達',
              '9917':u'中保',
              '1802':u'台玻',
              '1722':u'台肥',
              '1319':u'東陽',
              '3044':u'健鼎',
              '9933':u'中鼎',
              '6415':u'矽力-KY',
              '2204':u'中華',
              '2451':u'創見',
              '2634':u'漢翔',
              '2615':u'萬海',
              '1717':u'長興',
              '2923':u'鼎固-KY',
              '2049':u'上銀',
              }



for Ticker in Stock_dict:
    try:
        stock = web.DataReader(Ticker + '.TW','yahoo','2016-01-01')
        stock['MA'] = pd.rolling_mean(stock['Adj Close'],5)
        
        if stock['Adj Close'][-1] > stock['MA'][-1]:
            print Stock_dict[Ticker] + ': ' + str(stock['Adj Close'][-1]/stock['MA'][-1])
    except:
        pass
        
        
        
        
   





'''
df = pd.DataFrame(index = pd.date_range(start = '2016-01-01',end = datetime.datetime.today()))

for Ticker in Tickers:
    df[Ticker] = web.DataReader(Ticker + '.TW','yahoo','2016-01-01')['Adj Close']

df = df.dropna()

MA_df = pd.rolling_mean(df,20).dropna()
print MA_df
'''



